//--------------------|📝 : Note box

const noteData = [
  {
    title: "چشم انداز ما",
    text: "ما در تلاشیم تا نخستین و بهترین انتخاب مشتریانمان باشیم.",
  },
  {
    title: "هدف ما",
    text: "هدف ما تولید و توسعه نرم افزار های باکیفیت و درجه یک بر پایه دانش و تخصص روز با بهره گیری از توان بهترین متخصصان است.",
  },
  {
    title: "درباره ما",
    text: "گروه نرم افزاری کدمد با هدف ارائه خدمات نوین و با بهره گیری از دانش بومی متخصصان و مهندسان در سال 1404 تاسیس و فعالیت خود را در تهران آغاز نمود.",
  },
  {
    title: "محصولات ما",
    text: "محصولات ما طیف وسیعی از نرم افزار های تحت وب و اندرویدی بر پایه هوش مصنوعیست.",
  },
  {
    title: "خدمت ما",
    text: "ما با تحلیل و طراحی و پیاده سازی انواع نرم افزارهای سازمانی ، آموزشی و فروشگاهی برپایه هوش مصنوعی ارائه دهنده بهترین تکنولوژی در سطح کشور هستیم.",
  },
  {
    title: "ماموریت ما",
    text: "هر مشکلی یک فرصت طلایی برای بروز خلاقیت و ارائه یک راه حل درست است . ما با آینده نگری و نگاهی متمایز به فردا می اندیشیم و در تلاشیم بهترین فرصت های اقتصادی و علمی را برای مشتریان خود ایجاد کنیم.",
  },
];

function NoteBox() {
  return (
    <ul className="note-box">
      {noteData.map((note, index) => (
        <li className="note-box__note" key={index}>
          <h3>{note.title}</h3>
          <p>{note.text}</p>
        </li>
      ))}
    </ul>
  );
}

export default NoteBox;
